espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/SVD/nrf51.xml
        <register>
          <name>RAMONB</name>
          <description>Ram on/off.</description>
          <addressOffset>0x554</addressOffset>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>ONRAM2</name>
              <description>RAM block 2 behaviour in ON mode.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM2Off</name>
                  <description>RAM block 2 OFF in ON mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM2On</name>
                  <description>RAM block 2 ON in ON mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONRAM3</name>
              <description>RAM block 3 behaviour in ON mode.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM3Off</name>
                  <description>RAM block 33 OFF in ON mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM3On</name>
                  <description>RAM block 3 ON in ON mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFFRAM2</name>
              <description>RAM block 2 behaviour in OFF mode.</description>
              <lsb>16</lsb> <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM2Off</name>
                  <description>RAM block 2 OFF in OFF mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM2On</name>
                  <description>RAM block 2 ON in OFF mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFFRAM3</name>
              <description>RAM block 3 behaviour in OFF mode.</description>
              <lsb>17</lsb> <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM3Off</name>
                  <description>RAM block 3 OFF in OFF mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM3On</name>
                  <description>RAM block 3 ON in OFF mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>DCDCEN</name>
          <description>DCDC converter enable configuration register.</description>
          <addressOffset>0x578</addressOffset>
          <fields>
            <field>
              <name>DCDCEN</name>
              <description>Enable DCDC converter.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>DCDC converter disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>DCDC converter enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCFORCE</name>
          <description>DCDC power-up force register.</description>
          <addressOffset>0xA08</addressOffset>
          <fields>
            <field>
              <name>FORCEOFF</name>
              <description>DCDC power-up force off.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoForce</name>
                  <description>No force.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Force</name>
                  <description>Force.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEON</name>
              <description>DCDC power-up force on.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoForce</name>
                  <description>No force.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Force</name>
                  <description>Force.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
      </registers>
    </peripheral>

    <peripheral>
      <name>CLOCK</name>
      <version>522</version>
      <description>Clock control.</description>
      <groupName>CLOCK</groupName>
      <baseAddress>0x40000000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <alternatePeripheral>POWER</alternatePeripheral>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <interrupt>
        <name>POWER_CLOCK</name>
        <value>0</value>
      </interrupt>

