espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/SVD/nrf51.xml
        <register>
          <name>INTENCLR</name>
          <description>Interrupt enable clear register.</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>READY</name>
              <description>Disable interrupt on READY event.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Disable interrupt on ADDRESS event.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAYLOAD</name>
              <description>Disable interrupt on PAYLOAD event.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>END</name>
              <description>Disable interrupt on END event.</description>
              <lsb>3</lsb> <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLED</name>
              <description>Disable interrupt on DISABLED event.</description>
              <lsb>4</lsb> <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEVMATCH</name>
              <description>Disable interrupt on DEVMATCH event.</description>
              <lsb>5</lsb> <msb>5</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEVMISS</name>
              <description>Disable interrupt on DEVMISS event.</description>
              <lsb>6</lsb> <msb>6</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSSIEND</name>
              <description>Disable interrupt on RSSIEND event.</description>
              <lsb>7</lsb> <msb>7</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCMATCH</name>
              <description>Disable interrupt on BCMATCH event.</description>
              <lsb>10</lsb> <msb>10</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>CRCSTATUS</name>
          <description>CRC status of received packet.</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CRCSTATUS</name>
              <description>CRC status of received packet.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRCError</name>
                  <description>Packet received with CRC error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRCOk</name>
                  <description>Packet received with CRC ok.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>RXMATCH</name>
          <description>Received address.</description>
          <addressOffset>0x408</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXMATCH</name>
              <description>Logical address in which previous packet was received.</description>
              <lsb>0</lsb> <msb>2</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>RXCRC</name>
          <description>Received CRC.</description>
          <addressOffset>0x40C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXCRC</name>
              <description>CRC field of previously received packet.</description>
              <lsb>0</lsb> <msb>23</msb>
            </field>
          </fields>
        </register>

        <register>
          <name>DAI</name>
          <description>Device address match index.</description>
          <addressOffset>0x410</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DAI</name>
              <description>Index (n) of device address (see DAB[n] and DAP[n]) that obtained an address match.</description>
              <lsb>0</lsb> <msb>2</msb>
            </field>
          </fields>
        </register>

        <register>
          <name>PACKETPTR</name>
          <description>Packet pointer. Decision point: START task.</description>
          <addressOffset>0x504</addressOffset>
        </register>
        
        <register>
          <name>FREQUENCY</name>
          <description>Frequency.</description>
          <addressOffset>0x508</addressOffset>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>FREQUENCY</name>
              <description>Radio channel frequency offset in MHz: RF Frequency = 2400 + FREQUENCY (MHz). Decision point: TXEN or RXEN task. </description>
              <lsb>0</lsb> <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXPOWER</name>
          <description>Output power.</description>
          <addressOffset>0x50C</addressOffset>
          <fields>
            <field>
              <name>TXPOWER</name>
              <description>Radio output power. Decision point: TXEN task.</description>
              <lsb>0</lsb> <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Pos4dBm</name>
                  <description>+4dBm.</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0dBm</name>
                  <description>0dBm.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg4dBm</name>
                  <description>-4dBm.</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg8dBm</name>
                  <description>-8dBm.</description>
                  <value>0xF8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg12dBm</name>
                  <description>-12dBm.</description>
                  <value>0xF4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg16dBm</name>
                  <description>-16dBm.</description>
                  <value>0xF0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg20dBm</name>
                  <description>-20dBm.</description>
                  <value>0xEC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg30dBm</name>
                  <description>-30dBm.</description>
                  <value>0xD8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Data rate and modulation.</description>
          <addressOffset>0x510</addressOffset>
          <fields>
            <field>
              <name>MODE</name>
              <description>Radio data rate and modulation setting. Decision point: TXEN or RXEN task.</description>
              <lsb>0</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Nrf_1Mbit</name>
                  <description>1Mbit/s Nordic propietary radio mode.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nrf_2Mbit</name>
                  <description>2Mbit/s Nordic propietary radio mode.</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nrf_250Kbit</name>
                  <description>250kbit/s Nordic propietary radio mode.</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble_1Mbit</name>
                  <description>1Mbit/s Bluetooth Low Energy</description>
                  <value>0x03</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNF0</name>
          <description>Packet configuration 0.</description>
          <addressOffset>0x514</addressOffset>
          <fields>
            <field>
              <name>LFLEN</name>
              <description>Length of length field in number of bits. Decision point: START task.</description>
              <lsb>0</lsb> <msb>3</msb>
            </field>
            <field>
              <name>S0LEN</name>
              <description>Length of S0 field in number of bytes. Decision point: START task.</description>
              <lsb>8</lsb> <msb>8</msb>
            </field>
            <field>
              <name>S1LEN</name>
              <description>Length of S1 field in number of bits. Decision point: START task.</description>
              <lsb>16</lsb> <msb>19</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNF1</name>
          <description>Packet configuration 1.</description>
          <addressOffset>0x518</addressOffset>
          <fields>
            <field>
              <name>MAXLEN</name>
              <description>Maximum length of packet payload in number of bytes.</description>
              <lsb>0</lsb> <msb>7</msb>
            </field>
            <field>
              <name>STATLEN</name>
              <description>Static length in number of bytes. Decision point: START task.</description>
              <lsb>8</lsb> <msb>15</msb>
            </field>
            <field>
              <name>BALEN</name>
              <description>Base address length in number of bytes. Decision point: START task.</description>
              <lsb>16</lsb> <msb>18</msb>
            </field>
            <field>
              <name>ENDIAN</name>
              <description>On air endianness of packet length field. Decision point: START task.</description>
              <lsb>24</lsb> <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Little</name>
                  <description>Least significant bit on air first</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Big</name>
                  <description>Most significant bit on air first</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WHITEEN</name>
              <description>Packet whitening enable.</description>
              <lsb>25</lsb> <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Whitening disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Whitening enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BASE0</name>
          <description>Radio base address 0. Decision point: START task.</description>
          <addressOffset>0x51C</addressOffset>
        </register>
        <register>
          <name>BASE1</name>
          <description>Radio base address 1. Decision point: START task.</description>
          <addressOffset>0x520</addressOffset>
        </register>
        <register>
          <name>PREFIX0</name>
          <description>Prefixes bytes for logical addresses 0 to 3.</description>
          <addressOffset>0x524</addressOffset>
          <fields>
            <field>
              <name>AP0</name>
              <description>Address prefix 0. Decision point: START task.</description>
              <lsb>0</lsb> <msb>7</msb>
            </field>
            <field>
              <name>AP1</name>
              <description>Address prefix 1. Decision point: START task.</description>
              <lsb>8</lsb> <msb>15</msb>
            </field>
            <field>
              <name>AP2</name>
              <description>Address prefix 2. Decision point: START task.</description>
              <lsb>16</lsb> <msb>23</msb>
            </field>
            <field>
              <name>AP3</name>
              <description>Address prefix 3. Decision point: START task.</description>
              <lsb>24</lsb> <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PREFIX1</name>
          <description>Prefixes bytes for logical addresses 4 to 7.</description>
          <addressOffset>0x528</addressOffset>
          <fields>
            <field>
              <name>AP4</name>
              <description>Address prefix 4. Decision point: START task.</description>
              <lsb>0</lsb> <msb>7</msb>
            </field>
            <field>
              <name>AP5</name>
              <description>Address prefix 5. Decision point: START task.</description>
              <lsb>8</lsb> <msb>15</msb>
            </field>
            <field>
              <name>AP6</name>
              <description>Address prefix 6. Decision point: START task.</description>
              <lsb>16</lsb> <msb>23</msb>
            </field>
            <field>
              <name>AP7</name>
              <description>Address prefix 7. Decision point: START task.</description>
              <lsb>24</lsb> <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXADDRESS</name>
          <description>Transmit address select.</description>
          <addressOffset>0x52C</addressOffset>
          <fields>
            <field>
              <name>TXADDRESS</name>
              <description>Logical address to be used when transmitting a packet. Decision point: START task.</description>
              <lsb>0</lsb> <msb>2</msb>
            </field>
          </fields>
        </register>
