espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/SVD/nrf51.xml
        <register>
          <name>ERRORSRC</name>
          <description>Error source. Write error field to 1 to clear error.</description>
          <addressOffset>0x480</addressOffset>
          <fields>
            <field>
              <name>OVERRUN</name>
              <description>A start bit is received while the previous data still lies in RXD. (Data loss).</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPresent</name>
                  <description>Error not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Error present.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear error on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARITY</name>
              <description>A character with bad parity is received. Only checked if HW parity control is enabled.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPresent</name>
                  <description>Error not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Error present.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear error on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRAMING</name>
              <description>A valid stop bit is not detected on the serial data input after all bits in a character have been received.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPresent</name>
                  <description>Error not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Error present.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear error on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BREAK</name>
              <description>The serial data input is '0' for longer than the length of a data frame.</description>
              <lsb>3</lsb> <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPresent</name>
                  <description>Error not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Error present.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear error on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>ENABLE</name>
          <description>Enable UART and acquire IOs.</description>
          <addressOffset>0x500</addressOffset>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable UART and acquire IOs.</description>
              <lsb>0</lsb> <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>UART disabled.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>UART enabled.</description>
                  <value>0x04</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PSELRTS</name>
          <description>Pin select for RTS.</description>
          <addressOffset>0x508</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>PSELTXD</name>
          <description>Pin select for TXD.</description>
          <addressOffset>0x50C</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>PSELCTS</name>
          <description>Pin select for CTS.</description>
          <addressOffset>0x510</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>PSELRXD</name>
          <description>Pin select for RXD.</description>
          <addressOffset>0x514</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        
        <register>
          <name>RXD</name>
          <description>RXD register. On read action the buffer pointer is displaced. Once read the character is consumed. If read when no character available, the UART will stop working.</description>
          <addressOffset>0x518</addressOffset>
          <access>read-only</access>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>RXD</name>
              <description>RX data from previous transfer. Double buffered.</description>
              <lsb>0</lsb> <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXD</name>
          <description>TXD register.</description>
          <addressOffset>0x51C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXD</name>
              <description>TX data for transfer.</description>
              <lsb>0</lsb> <msb>7</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>BAUDRATE</name>
          <description>UART Baudrate.</description>
          <addressOffset>0x524</addressOffset>
          <fields>
            <field>
              <name>BAUDRATE</name>
              <description>UART baudrate.</description>
              <lsb>0</lsb> <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Baud1200</name>
                  <description>1200 baud.</description>
                  <value>0x0004F000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud2400</name>
                  <description>2400 baud.</description>
                  <value>0x0009D000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud4800</name>
                  <description>4800 baud.</description>
                  <value>0x0013B000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud9600</name>
                  <description>9600 baud.</description>
                  <value>0x00275000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud14400</name>
                  <description>14400 baud.</description>
                  <value>0x003B0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud19200</name>
                  <description>19200 baud.</description>
                  <value>0x004EA000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud28800</name>
                  <description>28800 baud.</description>
                  <value>0x0075F000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud38400</name>
                  <description>38400 baud.</description>
                  <value>0x009D5000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud57600</name>
                  <description>57600 baud.</description>
                  <value>0x00EBF000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud76800</name>
                  <description>76800 baud.</description>
                  <value>0x013A9000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud115200</name>
                  <description>115200 baud.</description>
                  <value>0x01D7E000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud230400</name>
                  <description>230400 baud.</description>
                  <value>0x03AFB000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud250000</name>
                  <description>250000 baud.</description>
                  <value>0x04000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud460800</name>
                  <description>460800 baud.</description>
                  <value>0x075F7000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud921600</name>
                  <description>921600 baud.</description>
                  <value>0x0EBED000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Baud1M</name>
                  <description>1M baud.</description>
                  <value>0x10000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Configuration of parity and hardware flow control register.</description>
          <addressOffset>0x56C</addressOffset>
          <fields>
            <field>
              <name>HWFC</name>
              <description>Hardware flow control.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Hardware flow control disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Hardware flow control enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARITY</name>
              <description>Include parity bit.</description>
              <lsb>1</lsb> <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Excluded</name>
                  <description>Parity bit excluded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Included</name>
                  <description>Parity bit included.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>POWER</name>
          <description>Peripheral power control.</description>
          <addressOffset>0xFFC</addressOffset>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Module power disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Module power enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
