espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/SVD/nrf51.xml
        <register>
          <name>ADDRESS</name>
          <description>Address used in the two-wire transfer.</description>
          <addressOffset>0x588</addressOffset>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Two-wire address.</description>
              <lsb>0</lsb> <msb>6</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>POWER</name>
          <description>Peripheral power control.</description>
          <addressOffset>0xFFC</addressOffset>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Module power disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Module power enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
      </registers>
    </peripheral>

    <peripheral derivedFrom="SPI0">
      <name>SPI1</name>
      <version>522</version>
      <description>SPI master 1.</description>
      <baseAddress>0x40004000</baseAddress>
      <groupName>SPI</groupName>
      <size>32</size>
      <access>read-write</access>
      <interrupt>
        <name>SPI1_TWI1</name>
        <value>4</value>
      </interrupt>
    </peripheral>

    <peripheral derivedFrom="TWI0">
      <name>TWI1</name>
      <version>522</version>
      <description>Two-wire interface master 1.</description>
      <baseAddress>0x40004000</baseAddress>
      <groupName>TWI</groupName>
      <size>32</size>
      <access>read-write</access>
      <alternatePeripheral>SPI1</alternatePeripheral>
      <interrupt>
        <name>SPI1_TWI1</name>
        <value>4</value>
      </interrupt>
    </peripheral>
    
    <peripheral>
      <name>SPIS1</name>
      <version>522</version>
      <description>SPI slave 1.</description>
      <baseAddress>0x40004000</baseAddress>
      <groupName>SPIS</groupName>
      <size>32</size>
      <access>read-write</access>
      <alternatePeripheral>SPI1</alternatePeripheral>
      <headerStructName>SPIS</headerStructName>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <interrupt>
        <name>SPI1_TWI1</name>
        <value>4</value>
      </interrupt>

      <registers>
        <register>
          <name>TASKS_ACQUIRE</name>
          <description>Acquire SPI semaphore.</description>
          <addressOffset>0x024</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_RELEASE</name>
          <description>Release SPI semaphore.</description>
          <addressOffset>0x028</addressOffset>
          <access>write-only</access>
        </register>

        <register>
          <name>EVENTS_END</name>
          <description>Granted transaction completed.</description>
          <addressOffset>0x104</addressOffset>
        </register>
        <register>
          <name>EVENTS_ACQUIRED</name>
          <description>Semaphore acquired.</description>
          <addressOffset>0x128</addressOffset>
        </register>

        <register>
          <name>SHORTS</name>
          <description>Shortcuts for SPIS.</description>
          <addressOffset>0x200</addressOffset>
          <fields>
            <field>
              <name>END_ACQUIRE</name>
              <description>Shortcut between END event and the ACQUIRE task.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Shortcut disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Shortcut enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>INTENSET</name>
          <description>Interrupt enable set register.</description>
          <addressOffset>0x304</addressOffset>
          <fields>
            <field>
              <name>END</name>
              <description>Enable interrupt on END event.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACQUIRED</name>
              <description>Enable interrupt on ACQUIRED event.</description>
              <lsb>10</lsb> <msb>10</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt enable clear register.</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>END</name>
              <description>Disable interrupt on END event.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACQUIRED</name>
              <description>Disable interrupt on ACQUIRED event.</description>
              <lsb>10</lsb> <msb>10</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>SEMSTAT</name>
          <description>Semaphore status.</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SEMSTAT</name>
              <description>Semaphore status.</description>
              <lsb>0</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Free</name>
                  <description>Semaphore is free.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>Semaphore is assigned to the CPU.</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPIS</name>
                  <description>Semaphore is assigned to the SPIS.</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPUPending</name>
                  <description>Semaphore is assigned to the SPIS, but a handover to the CPU is pending.</description>
                  <value>0x03</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status from last transaction.</description>
          <addressOffset>0x440</addressOffset>
          <fields>        
            <field>
              <name>OVERREAD</name>
              <description>TX buffer overread detected, and prevented.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPresent</name>
                  <description>Error not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Error present.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERFLOW</name>
              <description>RX buffer overflow detected, and prevented.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPresent</name>
                  <description>Error not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>Error present.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
               <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>ENABLE</name>
          <description>Enable SPIS.</description>
          <addressOffset>0x500</addressOffset>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable SPIS.</description>
              <lsb>0</lsb> <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled SPIS.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable SPIS.</description>
                  <value>0x02</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>PSELSCK</name>
          <description>Pin select for SCK.</description>
          <addressOffset>0x508</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>PSELMISO</name>
          <description>Pin select for MISO.</description>
          <addressOffset>0x50C</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>PSELMOSI</name>
          <description>Pin select for MOSI.</description>
          <addressOffset>0x510</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>PSELCSN</name>
          <description>Pin select for CSN.</description>
          <addressOffset>0x514</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        
        <register>
          <name>RXDPTR</name>
          <description>RX data pointer.</description>
          <addressOffset>0x534</addressOffset>
        </register>
        <register>
          <name>MAXRX</name>
          <description>Maximum number of bytes in the receive buffer.</description>
          <addressOffset>0x538</addressOffset>
          <fields>
            <field>
              <name>MAXRX</name>
              <description>Maximum number of bytes in the receive buffer.</description>
              <lsb>0</lsb> <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AMOUNTRX</name>
          <description>Number of bytes received in last granted transaction.</description>
          <addressOffset>0x53C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>AMOUNTRX</name>
              <description>Number of bytes received in last granted transaction.</description>
              <lsb>0</lsb> <msb>7</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>TXDPTR</name>
          <description>TX data pointer.</description>
          <addressOffset>0x544</addressOffset>
        </register>
        <register>
          <name>MAXTX</name>
          <description>Maximum number of bytes in the transmit buffer.</description>
          <addressOffset>0x548</addressOffset>
          <fields>
            <field>
              <name>MAXTX</name>
              <description>Maximum number of bytes in the transmit buffer.</description>
              <lsb>0</lsb> <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AMOUNTTX</name>
          <description>Number of bytes transmitted in last granted transaction.</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>AMOUNTTX</name>
              <description>Number of bytes transmitted in last granted transaction.</description>
              <lsb>0</lsb> <msb>7</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>CONFIG</name>
          <description>Configuration register.</description>
          <addressOffset>0x554</addressOffset>
          <fields>
            <field>
              <name>ORDER</name>
              <description>Bit order.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MsbFirst</name>
                  <description>Most significant bit transmitted out first.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LsbFirst</name>
                  <description>Least significant bit transmitted out first.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHA</name>
              <description>Serial clock (SCK) phase.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Leading</name>
                  <description>Sample on leading edge of the clock. Shift serial data on trailing edge.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trailing</name>
                  <description>Sample on trailing edge of the clock. Shift serial data on leading edge.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOL</name>
              <description>Serial clock (SCK) polarity.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ActiveHigh</name>
                  <description>Active high.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ActiveLow</name>
                  <description>Active low.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>DEF</name>
          <description>Default character.</description>
          <addressOffset>0x55C</addressOffset>
          <fields>
            <field>
              <name>DEF</name>
              <description>Default character.</description>
              <lsb>0</lsb> <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ORC</name>
          <description>Over-read character.</description>
          <addressOffset>0x5C0</addressOffset>
          <fields>
            <field>
              <name>ORC</name>
              <description>Over-read character.</description>
              <lsb>0</lsb> <msb>7</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>POWER</name>
          <description>Peripheral power control.</description>
          <addressOffset>0xFFC</addressOffset>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Module power disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Module power enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
