espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/SVD/nrf51.xml
      </registers>
    </peripheral>

    <peripheral>
      <name>SPIM1</name>
      <version>522</version>
      <description>SPI master with easyDMA 1.</description>
      <baseAddress>0x40004000</baseAddress>
      <groupName>SPIM</groupName>
      <size>32</size>
      <access>read-write</access>
      <alternatePeripheral>SPI1</alternatePeripheral>
      <headerStructName>SPIM</headerStructName>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <interrupt>
        <name>SPI1_TWI1</name>
        <value>4</value>
      </interrupt>

      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Start SPI transaction.</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop SPI transaction.</description>
          <addressOffset>0x014</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_SUSPEND</name>
          <description>Suspend SPI transaction.</description>
          <addressOffset>0x01C</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_RESUME</name>
          <description>Resume SPI transaction.</description>
          <addressOffset>0x020</addressOffset>
          <access>write-only</access>
        </register>

        <register>
          <name>EVENTS_STOPPED</name>
          <description>SPI transaction has stopped.</description>
          <addressOffset>0x104</addressOffset>
        </register>
        <register>
          <name>EVENTS_ENDRX</name>
          <description>End of RXD buffer reached.</description>
          <addressOffset>0x110</addressOffset>
        </register>
        <register>
          <name>EVENTS_ENDTX</name>
          <description>End of TXD buffer reached.</description>
          <addressOffset>0x120</addressOffset>
        </register>
        <register>
          <name>EVENTS_STARTED</name>
          <description>Transaction started.</description>
          <addressOffset>0x14C</addressOffset>
        </register>

        <register>
          <name>INTENSET</name>
          <description>Interrupt enable set register.</description>
          <addressOffset>0x304</addressOffset>
          <fields>
            <field>
              <name>STOPPED</name>
              <description>Enable interrupt on STOPPED event.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENDRX</name>
              <description>Enable interrupt on ENDRX event.</description>
              <lsb>4</lsb> <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENDTX</name>
              <description>Enable interrupt on ENDTX event.</description>
              <lsb>8</lsb> <msb>8</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STARTED</name>
              <description>Enable interrupt on STARTED event.</description>
              <lsb>19</lsb> <msb>19</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt enable clear register.</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>STOPPED</name>
              <description>Disable interrupt on STOPPED event.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENDRX</name>
              <description>Disable interrupt on ENDRX event.</description>
              <lsb>4</lsb> <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENDTX</name>
              <description>Disable interrupt on ENDTX event.</description>
              <lsb>8</lsb> <msb>8</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STARTED</name>
              <description>Disable interrupt on STARTED event.</description>
              <lsb>19</lsb> <msb>19</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            
          </fields>
        </register>

        <register>
          <name>ENABLE</name>
          <description>Enable SPIM.</description>
          <addressOffset>0x500</addressOffset>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable SPIM.</description>
              <lsb>0</lsb> <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled SPIM.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable SPIM.</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <cluster>
          <name>PSEL</name>
          <description>Pin select configuration.</description>
          <addressOffset>0x508</addressOffset>
          <headerStructName>SPIM_PSEL</headerStructName>
          <register>
            <name>SCK</name>
            <description>Pin select for SCK.</description>
            <addressOffset>0x0</addressOffset>
            <resetValue>0xFFFFFFFF</resetValue>
          </register>
          <register>
            <name>MOSI</name>
            <description>Pin select for MOSI.</description>
            <addressOffset>0x4</addressOffset>
            <resetValue>0xFFFFFFFF</resetValue>
          </register>
          <register>
            <name>MISO</name>
            <description>Pin select for MISO.</description>
            <addressOffset>0x8</addressOffset>
            <resetValue>0xFFFFFFFF</resetValue>
          </register>
        </cluster>
        
        <register>
          <name>FREQUENCY</name>
          <description>SPI frequency.</description>
          <addressOffset>0x524</addressOffset>
          <resetValue>0x04000000</resetValue>
          <fields>
            <field>
              <name>FREQUENCY</name>
              <description>SPI master data rate.</description>
              <lsb>0</lsb> <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>K125</name>
                  <description>125 kbps.</description>
                  <value>0x02000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K250</name>
                  <description>250 kbps.</description>
                  <value>0x04000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K500</name>
                  <description>500 kbps.</description>
                  <value>0x08000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1</name>
                  <description>1 Mbps.</description>
                  <value>0x10000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2</name>
                  <description>2 Mbps.</description>
                  <value>0x20000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4</name>
                  <description>4 Mbps.</description>
                  <value>0x40000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M8</name>
                  <description>8 Mbps.</description>
                  <value>0x80000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <cluster>
          <name>RXD</name>
          <description>RXD EasyDMA configuration and status.</description>
          <addressOffset>0x534</addressOffset>
          <headerStructName>SPIM_RXD</headerStructName>
          <register>
            <name>PTR</name>
            <description>Data pointer.</description>
            <addressOffset>0x0</addressOffset>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer.</description>
                <lsb>0</lsb> <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of buffer bytes to receive.</description>
            <addressOffset>0x4</addressOffset>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of buffer bytes to receive.</description>
                <lsb>0</lsb> <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of bytes received in the last transaction.</description>
            <addressOffset>0x8</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes received in the last transaction.</description>
                <lsb>0</lsb> <msb>7</msb>
              </field>
            </fields>
          </register>
        </cluster>
        
        <cluster>
          <name>TXD</name>
          <description>TXD EasyDMA configuration and status.</description>
          <addressOffset>0x544</addressOffset>
          <headerStructName>SPIM_TXD</headerStructName>
          <register>
            <name>PTR</name>
            <description>Data pointer.</description>
            <addressOffset>0x0</addressOffset>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer.</description>
                <lsb>0</lsb> <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of buffer bytes to send.</description>
            <addressOffset>0x4</addressOffset>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of buffer bytes to send.</description>
                <lsb>0</lsb> <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of bytes sent in the last transaction.</description>
            <addressOffset>0x8</addressOffset>
            <access>read-only</access>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes sent in the last transaction.</description>
                <lsb>0</lsb> <msb>7</msb>
              </field>
            </fields>
          </register>
        </cluster>
        
        <register>
          <name>CONFIG</name>
          <description>Configuration register.</description>
          <addressOffset>0x554</addressOffset>
          <fields>
            <field>
              <name>ORDER</name>
              <description>Bit order.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MsbFirst</name>
                  <description>Most significant bit transmitted out first.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LsbFirst</name>
                  <description>Least significant bit transmitted out first.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHA</name>
              <description>Serial clock (SCK) phase.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Leading</name>
                  <description>Sample on leading edge of the clock. Shift serial data on trailing edge.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Trailing</name>
                  <description>Sample on trailing edge of the clock. Shift serial data on leading edge.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOL</name>
              <description>Serial clock (SCK) polarity.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ActiveHigh</name>
                  <description>Active high.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ActiveLow</name>
                  <description>Active low.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>ORC</name>
          <description>Over-read character.</description>
          <addressOffset>0x5C0</addressOffset>
          <fields>
            <field>
              <name>ORC</name>
              <description>Over-read character.</description>
              <lsb>0</lsb> <msb>7</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>POWER</name>
          <description>Peripheral power control.</description>
          <addressOffset>0xFFC</addressOffset>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Module power disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Module power enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
