espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/SVD/nrf51.xml
      </registers>
    </peripheral>

    <peripheral>
      <name>ADC</name>
      <version>522</version>
      <description>Analog to digital converter.</description>
      <baseAddress>0x40007000</baseAddress>
      <groupName>ADC</groupName>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <interrupt>
        <name>ADC</name>
        <value>7</value>
      </interrupt>

      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Start an ADC conversion.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop ADC.</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
        </register>

        <register>
          <name>EVENTS_END</name>
          <description>ADC conversion complete.</description>
          <addressOffset>0x100</addressOffset>
        </register>

        <register>
          <name>INTENSET</name>
          <description>Interrupt enable set register.</description>
          <addressOffset>0x304</addressOffset>
          <fields>
            <field>
              <name>END</name>
              <description>Enable interrupt on END event.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt enable clear register.</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>END</name>
              <description>Disable interrupt on END event.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>BUSY</name>
          <description>ADC busy register.</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUSY</name>
              <description>ADC busy register.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>No ongoing ADC conversion is taking place. ADC is ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>An ADC conversion is taking place. ADC is busy.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>ENABLE</name>
          <description>ADC enable.</description>
          <addressOffset>0x500</addressOffset>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>ADC enable.</description>
              <lsb>0</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>ADC is disabled.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>ADC is enabled. If an analog input pin is selected as source of the conversion, the selected pin is configured as an analog input.</description>
                  <value>0x01</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>CONFIG</name>
          <description>ADC configuration register.</description>
          <addressOffset>0x504</addressOffset>
          <resetValue>0x00000018</resetValue>
          <fields>
            <field>
              <name>RES</name>
              <description>ADC resolution.</description>
              <lsb>0</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8bit</name>
                  <description>8bit ADC resolution.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9bit</name>
                  <description>9bit ADC resolution.</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10bit</name>
                  <description>10bit ADC resolution.</description>
                  <value>0x02</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPSEL</name>
              <description>ADC input selection.</description>
              <lsb>2</lsb> <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AnalogInputNoPrescaling</name>
                  <description>Analog input specified by PSEL with no prescaling used as input for the conversion.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInputTwoThirdsPrescaling</name>
                  <description>Analog input specified by PSEL with 2/3 prescaling used as input for the conversion.</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInputOneThirdPrescaling</name>
                  <description>Analog input specified by PSEL with 1/3 prescaling used as input for the conversion.</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SupplyTwoThirdsPrescaling</name>
                  <description>Supply voltage with 2/3 prescaling used as input for the conversion.</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SupplyOneThirdPrescaling</name>
                  <description>Supply voltage with 1/3 prescaling used as input for the conversion.</description>
                  <value>0x06</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFSEL</name>
              <description>ADC reference selection.</description>
              <lsb>5</lsb> <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBG</name>
                  <description>Use internal 1.2V bandgap voltage as reference for conversion.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>External</name>
                  <description>Use external source configured by EXTREFSEL as reference for conversion.</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SupplyOneHalfPrescaling</name>
                  <description>Use supply voltage with 1/2 prescaling as reference for conversion. Only usable when supply voltage is between 1.7V and 2.6V.</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SupplyOneThirdPrescaling</name>
                  <description>Use supply voltage with 1/3 prescaling as reference for conversion. Only usable when supply voltage is between 2.5V and 3.6V.</description>
                  <value>0x03</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSEL</name>
              <description>ADC analog pin selection.</description>
              <lsb>8</lsb> <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Analog input pins disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput0</name>
                  <description>Use analog input 0 as analog input.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput1</name>
                  <description>Use analog input 1 as analog input.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput2</name>
                  <description>Use analog input 2 as analog input.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput3</name>
                  <description>Use analog input 3 as analog input.</description>
                  <value>8</value>
                </enumeratedValue><enumeratedValue>
                  <name>AnalogInput4</name>
                  <description>Use analog input 4 as analog input.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput5</name>
                  <description>Use analog input 5 as analog input.</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput6</name>
                  <description>Use analog input 6 as analog input.</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput7</name>
                  <description>Use analog input 7 as analog input.</description>
                  <value>128</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTREFSEL</name>
              <description>ADC external reference pin selection.</description>
              <lsb>16</lsb> <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>None</name>
                  <description>Analog external reference inputs disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference0</name>
                  <description>Use analog reference 0 as reference.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference1</name>
                  <description>Use analog reference 1 as reference.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>RESULT</name>
          <description>Result of ADC conversion.</description>
          <addressOffset>0x508</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>Result of ADC conversion.</description>
              <lsb>0</lsb> <msb>9</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>POWER</name>
          <description>Peripheral power control.</description>
          <addressOffset>0xFFC</addressOffset>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Module power disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Module power enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

