espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/SVD/nrf51.xml
      </registers>
    </peripheral>

    <peripheral>
      <name>AAR</name>
      <version>522</version>
      <description>Accelerated Address Resolver.</description>
      <baseAddress>0x4000F000</baseAddress>
      <groupName>AAR</groupName>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <interrupt>
        <name>CCM_AAR</name>
        <value>15</value>
      </interrupt>

      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Start resolving addresses based on IRKs specified in the IRK data structure.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop resolving addresses.</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
        </register>

        <register>
          <name>EVENTS_END</name>
          <description>Address resolution procedure completed.</description>
          <addressOffset>0x100</addressOffset>
        </register>
        <register>
          <name>EVENTS_RESOLVED</name>
          <description>Address resolved.</description>
          <addressOffset>0x104</addressOffset>
        </register>
        <register>
          <name>EVENTS_NOTRESOLVED</name>
          <description>Address not resolved.</description>
          <addressOffset>0x108</addressOffset>
        </register>


        <register>
          <name>INTENSET</name>
          <description>Interrupt enable set register.</description>
          <addressOffset>0x304</addressOffset>
          <fields>
            <field>
              <name>END</name>
              <description>Enable interrupt on END event.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESOLVED</name>
              <description>Enable interrupt on RESOLVED event.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOTRESOLVED</name>
              <description>Enable interrupt on NOTRESOLVED event.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt enable clear register.</description>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>END</name>
              <description>Disable interrupt on ENDKSGEN event.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESOLVED</name>
              <description>Disable interrupt on RESOLVED event.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOTRESOLVED</name>
              <description>Disable interrupt on NOTRESOLVED event.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable interrupt on write.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>STATUS</name>
          <description>Resolution status.</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>STATUS</name>
              <description>The IRK used last time an address was resolved.</description>
              <lsb>0</lsb> <msb>3</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>ENABLE</name>
          <description>Enable AAR.</description>
          <addressOffset>0x500</addressOffset>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable AAR.</description>
              <lsb>0</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled AAR.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable AAR.</description>
                  <value>0x03</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
        <register>
          <name>NIRK</name>
          <description>Number of Identity root Keys in the IRK data structure.</description>
          <addressOffset>0x504</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>NIRK</name>
              <description>Number of Identity root Keys in the IRK data structure.</description>
              <lsb>0</lsb> <msb>4</msb>
            </field>
          </fields>
        </register>
        
        <register>
          <name>IRKPTR</name>
          <description>Pointer to the IRK data structure.</description>
          <addressOffset>0x508</addressOffset>
        </register>
        <register>
          <name>ADDRPTR</name>
          <description>Pointer to the resolvable address (6 bytes).</description>
          <addressOffset>0x510</addressOffset>
        </register>
        <register>
          <name>SCRATCHPTR</name>
          <description>Pointer to a "scratch" data area used for temporary storage during resolution. A minimum of 3 bytes must be reserved.</description>
          <addressOffset>0x514</addressOffset>
        </register>
        
        <register>
          <name>POWER</name>
          <description>Peripheral power control.</description>
          <addressOffset>0xFFC</addressOffset>
          <fields>
            <field>
              <name>POWER</name>
              <description>Peripheral power control.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Module power disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Module power enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        
