espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/SVD/nrf51.xml
      </registers>
    </peripheral>
      
    <peripheral>
      <name>SWI</name>
      <version>522</version>
      <description>SW Interrupts.</description>
      <groupName>SWI</groupName>
      <baseAddress>0x40014000</baseAddress>
      <size>32</size>

      <addressBlock>
        <offset>0</offset>
        <size>0x6000</size>
        <usage>registers</usage>
      </addressBlock>

      <interrupt>
        <name>SWI0</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>SWI1</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>SWI2</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>SWI3</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>SWI4</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>SWI5</name>
        <value>25</value>
      </interrupt>

      <registers>
        <register>
          <name>UNUSED</name>
          <description>Unused.</description>
          <addressOffset>0x000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>NVMC</name>
      <version>522</version>
      <description>Non Volatile Memory Controller.</description>
      <groupName>NVMC</groupName>
      <baseAddress>0x4001E000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>READY</name>
          <description>Ready flag.</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>READY</name>
              <description>NVMC ready.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>NVMC is busy (on-going write or erase operation).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>NVMC is ready.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>CONFIG</name>
          <description>Configuration register.</description>
          <addressOffset>0x504</addressOffset>
          <fields>
            <field>
              <name>WEN</name>
              <description>Program write enable.</description>
              <lsb>0</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ren</name>
                  <description>Read only access.</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Wen</name>
                  <description>Write enabled.</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Een</name>
                  <description>Erase enabled.</description>
                  <value>0x02</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>ERASEPAGE</name>
          <description>Register for erasing a non-protected non-volatile memory page.</description>
          <addressOffset>0x508</addressOffset>
        </register>
        <register>
          <name>ERASEPCR1</name>
          <description>Register for erasing a non-protected non-volatile memory page.</description>
          <addressOffset>0x508</addressOffset>
          <alternateRegister>ERASEPAGE</alternateRegister>
        </register>
        
        <register>
          <name>ERASEALL</name>
          <description>Register for erasing all non-volatile user memory.</description>
          <addressOffset>0x50C</addressOffset>
          <fields>
            <field>
              <name>ERASEALL</name>
              <description>Starts the erasing of all user NVM (code region 0/1 and UICR registers).</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoOperation</name>
                  <description>No operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Erase</name>
                  <description>Start chip erase.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <register>
          <name>ERASEPCR0</name>
          <description>Register for erasing a protected non-volatile memory page.</description>
          <addressOffset>0x510</addressOffset>
        </register>
        
        <register>
          <name>ERASEUICR</name>
          <description>Register for start erasing User Information Congfiguration Registers.</description>
          <addressOffset>0x514</addressOffset>
          <fields>
            <field>
              <name>ERASEUICR</name>
              <description>It can only be used when all contents of code region 1 are erased.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoOperation</name>
                  <description>No operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Erase</name>
                  <description>Start UICR erase.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
