espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/SVD/nrf51.xml
        <register>
          <name>DIR</name>
          <description>Direction of GPIO pins.</description>
          <addressOffset>0x514</addressOffset>
          <fields>
            <field>
              <name>PIN0</name>
              <description>Pin 0.</description>
              <lsb>0</lsb> <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN1</name>
              <description>Pin 1.</description>
              <lsb>1</lsb> <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN2</name>
              <description>Pin 2.</description>
              <lsb>2</lsb> <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN3</name>
              <description>Pin 3.</description>
              <lsb>3</lsb> <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN4</name>
              <description>Pin 4.</description>
              <lsb>4</lsb> <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN5</name>
              <description>Pin 5.</description>
              <lsb>5</lsb> <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN6</name>
              <description>Pin 6.</description>
              <lsb>6</lsb> <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN7</name>
              <description>Pin 7.</description>
              <lsb>7</lsb> <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN8</name>
              <description>Pin 8.</description>
              <lsb>8</lsb> <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN9</name>
              <description>Pin 9.</description>
              <lsb>9</lsb> <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN10</name>
              <description>Pin 10.</description>
              <lsb>10</lsb> <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN11</name>
              <description>Pin 11.</description>
              <lsb>11</lsb> <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN12</name>
              <description>Pin 12.</description>
              <lsb>12</lsb> <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN13</name>
              <description>Pin 13.</description>
              <lsb>13</lsb> <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN14</name>
              <description>Pin 14.</description>
              <lsb>14</lsb> <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN15</name>
              <description>Pin 15.</description>
              <lsb>15</lsb> <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN16</name>
              <description>Pin 16.</description>
              <lsb>16</lsb> <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN17</name>
              <description>Pin 17.</description>
              <lsb>17</lsb> <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN18</name>
              <description>Pin 18.</description>
              <lsb>18</lsb> <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN19</name>
              <description>Pin 19.</description>
              <lsb>19</lsb> <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN20</name>
              <description>Pin 20.</description>
              <lsb>20</lsb> <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN21</name>
              <description>Pin 21.</description>
              <lsb>21</lsb> <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN22</name>
              <description>Pin 22.</description>
              <lsb>22</lsb> <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN23</name>
              <description>Pin 23.</description>
              <lsb>23</lsb> <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN24</name>
              <description>Pin 24.</description>
              <lsb>24</lsb> <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN25</name>
              <description>Pin 25.</description>
              <lsb>25</lsb> <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN26</name>
              <description>Pin 26.</description>
              <lsb>26</lsb> <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN27</name>
              <description>Pin 27.</description>
              <lsb>27</lsb> <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN28</name>
              <description>Pin 28.</description>
              <lsb>28</lsb> <msb>28</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN29</name>
              <description>Pin 29.</description>
              <lsb>29</lsb> <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN30</name>
              <description>Pin 30.</description>
              <lsb>30</lsb> <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIN31</name>
              <description>Pin 31.</description>
              <lsb>31</lsb> <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Pin set as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>Pin set as output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
